<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°03

## Objetivos de la clase

* Reforzar los conceptos básicos de pandas.

## Contenidos

* [Problema 01](#p1)

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [425]:
import pandas as pd
import os

In [426]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|").set_index('user_id')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. ¿Cuál es el número de observaciones en el conjunto de datos?

In [427]:

print('El número de observaciones es de',df.shape[0],'elementos')

El número de observaciones es de 943 elementos

2. ¿Cuál es el número de columnas en el conjunto de datos?

In [428]:
print('El número de columnas es',df.shape[1])

El número de columnas es 4

3. Imprime el nombre de todas las columnas

In [429]:
list(df)

['age', 'gender', 'occupation', 'zip_code']

4. Imprima el índice del dataframe

In [430]:
print("index:")
print(df.index)

index:
Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

5. ¿Cuál es el tipo de datos de cada columna?

In [431]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

6. Resumir el conjunto de datos

In [432]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

7. Resume conjunto de datos  con todas las columnas

In [433]:
df.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

8. Imprimir solo la columna de **occupation**.

In [434]:
df['occupation'].head()

user_id
1    technician
2         other
3        writer
4    technician
5         other
Name: occupation, dtype: object

In [435]:
print(df['occupation'])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [436]:
a=df['occupation'].unique()  #Ocupación

print('En total hay',len(a),'categorias de ocupaciones')

En total hay 21 categorias de ocupaciones

In [437]:
list(a)

['technician',
 'other',
 'writer',
 'executive',
 'administrator',
 'student',
 'lawyer',
 'educator',
 'scientist',
 'entertainment',
 'programmer',
 'librarian',
 'homemaker',
 'artist',
 'engineer',
 'marketing',
 'none',
 'healthcare',
 'retired',
 'salesman',
 'doctor']

10. ¿Cuál es la ocupación más frecuente?

In [438]:
a=df['occupation'].unique()  #Ocupación

frec=pd.Series()
for ocupa in a:
    df_aux = df.loc[lambda x: x['occupation'] == ocupa]
    #print(df_aux)
    frec[ocupa] = len(df_aux)

frec

<ipython-input-438-901d77bb1c0e>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  frec=pd.Series()

technician        27
other            105
writer            45
executive         32
administrator     79
student          196
lawyer            12
educator          95
scientist         31
entertainment     18
programmer        66
librarian         51
homemaker          7
artist            28
engineer          67
marketing         26
none               9
healthcare        16
retired           14
salesman          12
doctor             7
dtype: int64

In [439]:
# dataframe with list
df_list1 = pd.DataFrame([], columns = ['ocupaciones'])
df_list1['ocupaciones']=frec
frec_mas=frec[frec==frec.max()]
frec_mas

print('la ocupación más frecuete es:',frec_mas)

la ocupación más frecuete es: student    196
dtype: int64

11. ¿Cuál es la edad media de los usuarios?

In [440]:
import math


print('La edad media de los usuarios es :',math.floor(df['age'].mean()))

La edad mediade los usuarios es : 34

12. ¿Cuál es la edad con menos ocurrencia?

In [441]:
b=df['age'].unique()
frec_edad=pd.Series()
#nba_position_duration = pd.Series()
for edad in b:
    df_aux = df.loc[lambda x: x['age'] == edad]
    edad_str=str(edad)
    frec_edad[edad_str] = len(df_aux)

<ipython-input-441-34841642a62d>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  frec_edad=pd.Series()

In [442]:
# dataframe with list
df_list = pd.DataFrame([], columns = ["edad"])
df_list['edad']=frec_edad
edad_menos=frec_edad[frec_edad==frec_edad.min()]

In [443]:
print('Las edades menos concurridas son: 7,66,11,10 y 73 años')
edad_menos

Las edades menos concurridas son: 7,66,11,10 y 73 años

7     1
66    1
11    1
10    1
73    1
dtype: int64